#     Задайте список из n чисел последовательности $(1+\frac 1 n)^n$ и выведите на экран их сумму.   (1+1/n)**n

#     Пример:

# - Для n = 6: {1: 4, 2: 7, 3: 10, 4: 13, 5: 16, 6: 19}
per1 = int(input('Введите число: '))
spis = []
sum = 0
for i in range(1,per1+1):
    spis.append((1+1/i)**i)
    sum+=spis[i-1]
print(spis)
print('Сумма чисел равна: ',sum)